# Problem

In [1]:
import pandas as pd
import numpy as np
print("Before:-")
print()
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

Before:-

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [2]:
# 1)
df.iloc[[1], [1]] = df.iloc[[1], [1]].replace(np.nan, 10055)
df.iloc[[3], [1]] = df.iloc[[3], [1]].replace(np.nan, 10075)
df["FlightNumber"] = np.int64(df["FlightNumber"])

In [3]:
df[["From","Destination"]] = df.From_To.str.split('_',expand=True)

In [4]:
# 3)
df["From"] = df["From"].str.upper().str.title()
df["Destination"] = df["Destination"].str.upper().str.title()

In [5]:
# 4)
df = df.drop('From_To',axis = 1)

In [6]:
# 5)
df["From"] = df["From"].str.upper().str.title()
df["Destination"] = df["Destination"].str.upper().str.title()
df[["Delay_1", "Delay_2", "Delay_3"]] = pd.DataFrame(df.RecentDelays.tolist(), index = df.index)
print("After:-")
print()
df

After:-

   FlightNumber  RecentDelays              Airline  ... Delay_1 Delay_2  Delay_3
0         10045      [23, 47]               KLM(!)  ...    23.0    47.0      NaN
1         10055            []    <Air France> (12)  ...     NaN     NaN      NaN
2         10065  [24, 43, 87]  (British Airways. )  ...    24.0    43.0     87.0
3         10075          [13]       12. Air France  ...    13.0     NaN      NaN
4         10085      [67, 32]          "Swiss Air"  ...    67.0    32.0      NaN

[5 rows x 8 columns]